{
  "_name_or_path": "fixie-ai/ultravox-v0_5-llama-3_2-1b",
  "architectures": [
    "UltravoxModel"
  ],
  "audio_config": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "openai/whisper-large-v3-turbo",
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "apply_spec_augment": false,
    "architectures": [
      "WhisperForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "begin_suppress_tokens": [
      220,
      50256
    ],
    "bos_token_id": 50257,
    "d_model": 1280,
    "decoder_attention_heads": 20,
    "decoder_ffn_dim": 5120,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 4,
    "decoder_start_token_id": 50258,
    "dropout": 0.0,
    "encoder_attention_heads": 20,
    "encoder_ffn_dim": 5120,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 32,
    "eos_token_id": 50257,
    "init_std": 0.02,
    "is_encoder_decoder": true,
    "max_source_positions": 1500,
    "max_target_positions": 448,
    "median_filter_width": 7,
    "model_type": "whisper",
    "num_hidden_layers": 32,
    "num_mel_bins": 128,
    "pad_token_id": 50257,
    "scale_embedding": false,
    "torch_dtype": "float16",
    "use_cache": true,
    "vocab_size": 51866
  },
  "audio_latency_block_size": null,
  "audio_model_id": null,
  "audio_model_lora_config": {
    "lora_alpha": 8,
    "r": 0,
    "target_modules": [
      "k_proj",
      "q_proj",
      "linear_k",
      "linear_q"
    ]
  },
  "auto_map": {
    "AutoConfig": "ultravox_config.UltravoxConfig",
    "AutoModel": "ultravox_model.UltravoxModel",
    "AutoProcessor": "fixie-ai/ultravox-v0_5-llama-3_2-1b--ultravox_processing.UltravoxProcessor"
  },
  "custom_pipelines": {
    "ultravox-pipeline": {
      "impl": "fixie-ai/ultravox-v0_5-llama-3_2-1b--ultravox_pipeline.UltravoxPipeline",
      "pt": [
        "AutoModel"
      ],
      "tf": [],
      "type": "multimodal"
    }
  },
  "hidden_size": 4096,
  "ignore_index": -100,
  "initializer_range": 0.02,
  "model_type": "ultravox",
  "norm_init": 0.4,
  "num_attention_heads": 32,
  "num_hidden_layers": 16,
  "pad_token_id": 128009,
  "projector_act": "swiglu",
  "projector_ln_mid": true,
  "stack_factor": 8,
  "text_model_id": "meta-llama/Llama-3.2-1B-Instruct",
  "text_model_lora_config": {
    "lora_alpha": 8,
    "r": 0,
    "target_modules": [
      "k_proj",
      "q_proj",
      "linear_k",
      "linear_q"
    ]
  },
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 128256
}
